УправлениеДомашнимиРасходами/src/Documents/ПоступленияДенежныхСредств/ПоступленияДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступленияДенежныхСредств</name>
  <registerRecords>AccumulationRegister.ДоходыИРасходы</registerRecords>
  <tabularSections>
    <name>Поступления</name>
    <attributes>
      <name>ИсточникПоступления</name>
      <type>
        <types>CatalogRef.ИсточникиДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>НачалоПериода</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонецПериода</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УправлениеДомашнимиРасходами/src/AccumulationRegisters/ДоходыИРасходы/ДоходыИРасходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДоходыИРасходы</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Основание</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоходыРасходы</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УправлениеДомашнимиРасходами/src/Documents/ПоступленияДенежныхСредств/ObjectModule.bsl
//// @strict-types


#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий 


Процедура ОбработкаПроведения(Отказ,Режим)

	Движения.ДоходыИРасходы.Записывать = Истина;
	Для Каждого ТекСтрокаПоступления из Поступления Цикл
		Движение = Движения.ДоходыИРасходы.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Основание = Ссылка;
		Движение.Статья = ТекСтрокаПоступления.ИсточникПоступления;
		Движение.Сумма = ТекСтрокаПоступления.Сумма;
	КонецЦикла;

КонецПроцедуры
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
